In [6]:
import pandas as pd 
import numpy as np 

df=pd.read_csv("C:\\Transactions.csv")
df.head()

,transaction_id,cust_id,tran_date,prod_subcat_code,prod_cat_code,Qty,Rate,Tax,total_amt,Store_type
0,80712190438,270351,28-02-2014,1,1,-5,-772,405.300,-4265.300,e-Shop
1,29258453508,270384,27-02-2014,5,3,-5,-1497,785.925,-8270.925,e-Shop
2,51750724947,273420,24-02-2014,6,5,-2,-791,166.110,-1748.110,TeleShop
3,93274880719,271509,24-02-2014,11,6,-3,-1363,429.345,-4518.345,e-Shop
4,51750724947,273420,23-02-2014,6,5,-2,-791,166.110,-1748.110,TeleShop

In [7]:
df.shape

(23053, 10)

In [10]:
# Check for duplicates
duplicate_ids = df[df.duplicated(subset='transaction_id', keep=False)]['transaction_id'].unique()

print("Duplicate transaction IDs:")
print(duplicate_ids)

print(f"Total duplicate transaction IDs: {len(duplicate_ids)}")

Duplicate transaction IDs:
[80712190438 29258453508 51750724947 ... 90114483354 99568595128
 71176929896]
Total duplicate transaction IDs: 2057

In [11]:
df_cleaned = df.drop_duplicates(subset='transaction_id', keep='first')
print(f"Rows after removing duplicates: {len(df_cleaned)}")

Rows after removing duplicates: 20878

In [ ]:
df_cleaned.to_csv("transactions_cleaned.csv", index=False)

In [16]:
# Check missing values count per column
missing_values = df_cleaned.isnull().sum()

print("Missing values per column:")
print(missing_values)

Missing values per column:
transaction_id      0
cust_id             0
tran_date           0
prod_subcat_code    0
prod_cat_code       0
Qty                 0
Rate                0
Tax                 0
total_amt           0
Store_type          0
dtype: int64

In [17]:
df1= pd.read_csv("transactions_cleaned.csv")

In [20]:
# Convert tran_date from DD-MM-YYYY to YYYY-MM-DD
df1['tran_date'] = pd.to_datetime(df1['tran_date'], dayfirst=True, errors='coerce')
print(df1['tran_date'].head())

# Convert back to string for MySQL import
df1['tran_date'] = df1['tran_date'].dt.strftime('%Y-%m-%d')
print(df1['tran_date'].head())

0   2014-02-28
1   2014-02-27
2   2014-02-24
3   2014-02-24
4   2014-02-23
Name: tran_date, dtype: datetime64[ns]
0    2014-02-28
1    2014-02-27
2    2014-02-24
3    2014-02-24
4    2014-02-23
Name: tran_date, dtype: object

In [21]:
missing_tran_date = df1['tran_date'].isnull().sum()
print(f"Number of missing or null values in 'tran_date': {missing_tran_date}")

Number of missing/null values in 'tran_date': 8270

In [22]:
#Fill missing values with default date
df1['tran_date'].fillna('2000-01-01', inplace=True)

In [24]:
missing_tran_date = df1['tran_date'].isnull().sum()
print(missing_tran_date)

0

In [25]:
missing_values = df1.isnull().sum()
print("Missing values per column:")
print(missing_values)

Missing values per column:
transaction_id      0
cust_id             0
tran_date           0
prod_subcat_code    0
prod_cat_code       0
Qty                 0
Rate                0
Tax                 0
total_amt           0
Store_type          0
dtype: int64

In [26]:
df1.to_csv("transaction.csv", index=False)

In [27]:
df1.shape

(20878, 10)